<?php

/*
 *
 * 毕达哥拉斯三元组是三个自然数a < b < c组成的集合，并满足
a2 + b2 = c2
例如，32 + 42 = 9 + 16 = 25 = 52。
有且只有一个毕达哥拉斯三元组满足 a + b + c = 1000。求这个三元组的乘积abc。

草 这个居然是平方


定理：正整数x,y,z构成一个本原毕达哥拉斯三元组且y为偶数，当且仅当存在互素的正整数m，n(m>n),其中m为奇数n为偶数，或者m为偶数n为奇数，并且满足：
                                           x=m^2-n^2
                                           y=2mn
                                           z=m^2+n^2



1000====375~~200~~425
180625==180625
31875000

 * */


for($i=1;$i<1000;$i=$i+2){
    for($j=2;$j<1000;$j=$j+2){

        $x = pow($j,2) - pow($i,2);
        $y = 2*$j*$i;
        $z =  pow($j,2) + pow($i,2);

        if(((pow($x,2)+pow($y,2))==pow($z,2))&&($x+$y+$z==1000)){

               echo  $x+$y+$z."====".$x."~~".$y."~~".$z."\r\n";
               echo   (pow($x,2)+pow($y,2)).'=='.pow($z,2)."\r\n";
               echo $x*$y*$z;
               exit;
        }
    }
}


